# Adding taps (repos) on top as I was getting errors
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"

# Core install
brew "stow"
brew "git"
brew "bat"
brew "wget"
brew "fnm"
brew "tree"

# Dev install
brew "node"
brew "pnpm"
cask "visual-studio-code"
cask "postman"
cask "raycast"
cask "iterm2"
cask "github"

# Misc Install
cask "discord"
cask "google-drive"
cask "setapp"
cask "arc"
cask "loom"
cask "figma"
cask "steam"
cask "alt-tab"
cask "maccy"
cask "notion"
cask "applite"
cask "adobe-creative-cloud"
cask "crossover"
cask "little-snitch"

# Install apps from Appstore using mas
brew "mas"
mas 'Beepify', id: 147_464_4374
mas 'Dashlane', id: 517_914_548
