# Adding taps (repos) on top as I was getting errors
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "shopify/shopify"

# Core install
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "git" # Distributed revision control system
brew "wget" # Internet file retriever
brew "fnm" # Fast and simple Node.js version manager
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "asimov" # Automatically exclude development dependencies from Time Machine backups
brew "themekit" # Automatically exclude development dependencies from Time Machine backups

# Dev install
brew "themekit" # Theme Kit is a cross-platform command line tool that you can use to build Shopify themes. To get up and running quickly with Theme Kit, follow the steps in this guide.
brew "libreoffice" # Free cross-platform office suite, fresh version
brew "deno" # Secure runtime for JavaScript and TypeScript
brew "node" # Platform built on V8 to build network applications
brew "pnpm" # Fast, disk space efficient package manager
cask "visual-studio-code"
cask "postman"
cask "raycast"
cask "iterm2"
cask "github"
# cask "brave-browser"
cask "docker"
cask "amazon-q"
cask "postgres-unofficial"


# Misc Install
cask "appcleaner"
cask "discord"
cask "google-drive"
cask "setapp"
cask "arc"
cask "loom"
cask "figma"
cask "steam"
cask "alt-tab"
# cask "maccy"
cask "notion"
cask "adobe-creative-cloud"
cask "crossover"
cask "raindropio"
cask "macs-fan-control"

# Install apps from Appstore using mas
brew "mas" # Mac App Store command-line interface
# mas 'Amphetamine', id: 937_984_704
mas 'Beepify', id: 147_464_4374
mas 'Dashlane', id: 517_914_548
mas 'Microsoft Outlook', id: 985_367_838
mas 'Hidden Bar', id: 145_245_3066
